'use client'
import { title } from "../primitives";
import { clsx } from "clsx";
import 'keen-slider/keen-slider.min.css'
import '@smastrom/react-rating/style.css'
import { AccordionList } from "../Shared/Accordian";


type Props = {
};


const list = [
    {
        title: 'ویرچوال لرن چیه؟',
        description: 'ویرچوال لرن یک پلتفرم جامع آموزش برنامه‌نویسی است که به طور اختصاصی برای فارسی‌زبانان طراحی شده. این سایت با ترجمه و ارائه دوره‌های آموزشی از آکادمی‌های بین‌المللی معتبر، دسترسی کاربران به محتوای تخصصی و به‌روز را آسان‌تر کرده است. هدف ویرچوال لرن این است که بدون نیاز به مهارت در زبان انگلیسی، علاقه‌مندان بتوانند به بهترین منابع آموزشی دسترسی پیدا کنند و مهارت‌های برنامه‌نویسی خود را در سریع‌ترین زمان ممکن ارتقا دهند.',
    },
    {
        title: 'چه نوع آموزش‌هایی توی ویرچوال لرن هست؟',
        description: 'در ویرچوال لرن، طیف گسترده‌ای از آموزش‌های تخصصی در زمینه برنامه‌نویسی وجود دارد. از دوره‌های پایه‌ای مانند HTML، CSS و جاوااسکریپت گرفته تا دوره‌های پیشرفته مثل React، Node.js، Python و فریمورک‌های محبوب، همه در دسترس هستند. همچنین، دوره‌های تخصصی در زمینه توسعه وب، اپلیکیشن‌های موبایل و نرم‌افزارهای سمت سرور نیز ارائه می‌شود. همه این دوره‌ها با زیرنویس فارسی دقیق و ترجمه شده برای راحتی کاربران در یادگیری فراهم شده‌اند.',
    },
    {
        title: 'زیرنویس‌های آموزش‌ها از کجا میاد؟',
        description: 'زیرنویس‌های دوره‌های آموزشی ویرچوال لرن با استفاده از سایت‌ها و ابزارهای هوش مصنوعی ترجمه می‌شوند. این فناوری به تیم ویرچوال لرن کمک می‌کند تا با سرعت و دقت بیشتری محتوای آموزشی را برای کاربران فارسی‌زبان فراهم کند. زیرنویس‌ها به گونه‌ای طراحی شده‌اند که مفاهیم فنی و پیچیده به ساده‌ترین شکل ممکن به زبان فارسی منتقل شوند. این روش نه تنها دقت بالایی دارد، بلکه باعث می‌شود زیرنویس‌ها همیشه به‌روز و همگام با جدیدترین نسخه‌های ویدئوها باشند.',
    }
];





const FAQ = (props: Props) => {


    return (
        <div className="w-full  relative">

            <div className="pb-10 flex flex-col">
                <div className="w-full ">
                    <div className="w-full mt-4 text-center ">
                        <h4 className={clsx(title({ color: 'blue' }), 'inline w-full text-center text-[1.5rem] md:text-[2.5rem] !font-extrabold md:leading-[3.2rem]')}>
                            سوالات متداول
                        </h4>

                        <div className="mt-6 md:mt-10">
                            <AccordionList accordions={list} />
                        </div>

                    </div>
                </div>

            </div>

        </div >
    );
};

export default FAQ;
